app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (("users"."title" IS NOT NULL AND "users"."body" IS NOT NULL))
---
  def index
    @users = User.where{ (title != nil) & (body != nil) }

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "users" SET "body" = '<p>Nothing to see here. D''oh!<em>asdfdsaf</em><strong>sadfda</strong></p>', "updated_at" = '2013-07-01 01:17:27.486233' WHERE "users"."id" = 2
---
  def update
    @user = User.find(params[:id])
    respond_to do |format|
      if @user.update_attributes(params[:user])